TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПечатьАктВозврата_Беларусь/гкс_ПечатьАктВозврата_Беларусь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПечатьАктВозврата_Беларусь</name>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НомераЗаполняемыхАвтоматическиГрафПечатныхФорм/гкс_НомераЗаполняемыхАвтоматическиГрафПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НомераЗаполняемыхАвтоматическиГрафПечатныхФорм</name>
  <enumValues>
    <name>НазваниеСтандарта</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ТекстыГрафПечатныхФормДокументов/гкс_ТекстыГрафПечатныхФормДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТекстыГрафПечатныхФормДокументов</name>
  <attributes>
    <name>Графа</name>
    <type>
      <types>EnumRef.гкс_НомераЗаполняемыхАвтоматическиГрафПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстГрафы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПечатьАктВозврата_Беларусь/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СтруктураТипов = гкс_ОбщегоНазначенияПЛК.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктВозврата_by") Тогда
		
		ТабличныйДокумент = ПечатнаяФормаАктаВозврата(СтруктураТипов, ОбъектыПечати, ПараметрыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
																"ПФ_MXL_АктВозврата_by",
																НСтр("ru='Акт возврата'"),
																ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти	
	
#Область СлужебныеПроцедурыИФункции

#Область Печать_АктВозврата

Функция ПечатнаяФормаАктаВозврата(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_АктВозврата_by";
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл

		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = гкс_ЛокализацияСервер.МодульЛокализации(СтруктураОбъектов.Ключ);
		Если МенеджерОбъекта = Неопределено Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		КонецЕсли;
		
			ДанныеДляПечати = МенеджерОбъекта.
			ДанныеДляПечатнойФормыАктВозврата(СтруктураОбъектов.Значение);
		
		Если Не ДанныеДляПечати = Неопределено Тогда
			ЗаполнитьТабличныйДокументАктВозврата(ТабличныйДокумент,
															ДанныеДляПечати,
															ОбъектыПечати,
															ПараметрыПечати);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура заполняет табличный документ "акт расхождения веса"
//
Процедура ЗаполнитьТабличныйДокументАктВозврата(ТабличныйДокумент,
														ДанныеДляПечати,
														ОбъектыПечати,
														ПараметрыПечати)
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам	= ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.гкс_ПечатьАктВозврата_Беларусь.ПФ_MXL_АктВозврата_by",
													гкс_ЛокализацияСервер.КодЛокализацииБазы());
	
	ДанныеДополнительные = Новый Структура;
	ПараметрыПечати.Свойство("ДанныеПечати", ДанныеДополнительные);
	
	ДанныеШапки = СтруктураПоРезультатуЗапроса(ДанныеДляПечати.РезультатПоШапке);
	ДанныеСтроки = СтруктураПоРезультатуЗапроса(ДанныеДляПечати.РезультатПоТабличнойЧасти);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ДанныеШапки, ДанныеПечати);
        ДобавитьШаблоныВДанныеШапки(ДанныеШапки);
		СтруктураПоиска = Новый Структура("ЛабАнализ", ДанныеШапки.ЛабАнализ);
		ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
	
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТЧ");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
		
		ПараметрыШапки = ОбластьШапка.Параметры;
		
		Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыШапки.Заполнить(ДанныеШапки);
		ПараметрыШапки.Заполнить(ДанныеДополнительные);
		
		ПараметрыШапки.ДатаЛабАнализ = Формат(ДанныеШапки.ДатаЛабАнализ,"ДФ=dd.MM.yyyy");
		ПараметрыШапки.ДатаТН = Формат(ДанныеШапки.ДатаТН,"ДФ=dd.MM.yyyy");
		ПараметрыШапки.НомерЛабАнализ = СокрЛП(ДанныеШапки.НомерЛабАнализ);
		ПараметрыШапки.Водитель = гкс_ОбщегоНазначения.ФИОДляПечати(ПараметрыШапки.Водитель);
		
		Лаборант = ПараметрыШапки.Лаборант;
		Если ЗначениеЗаполнено(Лаборант) Тогда
			ПараметрыШапки.Лаборант = гкс_ОбщегоНазначения.ФИОДляПечати(ПараметрыШапки.Лаборант);
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		Пока СтрокаТовары.Следующий() Цикл
			
			ПараметрыСтроки = ОбластьСтрока.Параметры;
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТовары);
			
			ПараметрыСтроки.Заполнить(ДанныеСтроки);
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		Если СтрокаТовары.Количество() = 0 Тогда
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЕсли;
		
		Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
			
		ПараметрыПодвала = ОбластьПодвал.Параметры;
		ПараметрыПодвала.Заполнить(ДанныеШапки);
		ПараметрыПодвала.Заполнить(ДанныеДополнительные);
		ПараметрыПодвала.Водитель = гкс_ОбщегоНазначения.ФИОДляПечати(ПараметрыПодвала.Водитель);
		
		Лаборант = ПараметрыПодвала.Лаборант;
		Если ЗначениеЗаполнено(Лаборант) Тогда
			ПараметрыПодвала.Лаборант = гкс_ОбщегоНазначения.ФИОДляПечати(ПараметрыПодвала.Лаборант);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ПервыйДокумент = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьШаблоныВДанныеШапки(ДанныеШапки)    
	
	Шаблоны = Новый Структура();
	Шаблоны.Вставить("НазваниеСтандарта", "Маслосемена рапса. Требования при заготовках и поставках");

	НоменклатураСсылка = Неопределено;
	ДанныеШапки.Свойство("НоменклатураСсылка", НоменклатураСсылка);
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
  
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		| ТекстыГраф.ТекстГрафы КАК ТекстГрафы
		|ИЗ
		| Справочник.гкс_ТекстыГрафПечатныхФормДокументов КАК ТекстыГраф
		|ГДЕ
		| ТекстыГраф.Номенклатура = &Номенклатура
		| И НЕ ТекстыГраф.ПометкаУдаления
		| И ТекстыГраф.Графа = &Графа
		| И ТекстыГраф.ТекстГрафы <> """"";

		Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
		Запрос.УстановитьПараметр("Графа",
			Перечисления.гкс_НомераЗаполняемыхАвтоматическиГрафПечатныхФорм.НазваниеСтандарта);
		РезультатЗапроса = Запрос.Выполнить();

		Если Не РезультатЗапроса.Пустой() Тогда

			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл
				Шаблоны.Вставить("НазваниеСтандарта", Выборка.ТекстГрафы);
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеШапки, Шаблоны, Ложь);
	
КонецПроцедуры

Функция СтруктураПоРезультатуЗапроса(РезультатЗапроса)
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#КонецОбласти

#КонецЕсли
